{
  "main": {
    "name": "Saif Alushi",
    "occupation": "Software Engineer",
    "image": "profilepic.jpg",
    "bio": "Hello my name is Saif Alushi! I am a junior Software Engineer who loves headaches... I mean building cool software! My first introduction to programming was right before I started college. I asked my friend for an old textbook of his from any CS class and I taught my self C++. From there I went on to pursue my associates in computer science and work in sales/client-facing roles. I later dropped out of college and started at Uber! During my time at Uber I realized I looking forward to the end of the day so I could start building web apps more so than my actual work. So I quit my job and attended General Assembly.",
    "contactmessage": "Get in touch with me!",
    "email": "alushisaif@gmail.com",
    "phone": "",
    "address": {
      "street": "",
      "city": "Chicago",
      "state": "IL",
      "zip": ""
    },
    "website": "https://www.papareact.com/course",
    "resumedownload": "resume.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/saif-alushi/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/saifalushi1",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "General Assembly",
        "degree": "Software Engineering Immersive"
      } 
    ],
    "work": [
      {
        "company": "Pampered Chef",
        "title": "Jr. Software Engineer",
        "years": "Jul 2022 - Present",
        "description": "Developing and improving services with a microservices architecture. Practicing TDD, Agile, and learning clean structured system architecture (Domain-Driven-Design). Researched performance issues and implemented a solution to reduce API response times by over 53%. Implementing full-stack features/services in TypeScript using Node.js, Express, RxJS, React, Angular, and MongoDB. Created batch jobs for subscriptions that run on AWS. Working in a CI/CD pipeline using Jenkins and AWS for deploy"
      },
      {
        "company": "Uber",
        "title": "SMB Consultant",
        "years": "Aug 2021 - Jan 2022",
        "description": "Negotiated sales deals between businesses and Uber, resulting in mutually beneficial agreements and cultivated relationships. Built and strengthened relationships with new and existing accounts to drive revenue growth. Identified client business needs by gaining understanding of goals, objectives and processes. Recorded and maintained sales prospect and sales data within salesforce. Stayed up-to-date on changing industry and product standards and trends relatedto accounts. Created solutions to problems through the U4B platform and allowed businesses to leverage Uber's core services."
      },
      {
        "company": "Swhaus",
        "title": "Sr. Account Executive",
        "years": "May 2020 - Aug 2021",
        "description": "Built and strengthened relationships with new and existing accounts to drive revenue growth. Helped implement go-to-market sales strategy using company data to accurately target our demographic. Created and managed digital marketing campaigns specifically to suit client needs. Created and assisted in content marketing strategies to help expand outreach. Client relationships that I have established but are not limited to: TVMG, Dress to Impress, Built by.AI, Sociafy, Financial Assest Protection, S2 CommerceView. Generated over $1M in revenue. Helped generate hundreds of inbound leads for our company through improved marketing campaigns and ads."
      },
      {
        "company": "Chicago Connect",
        "title": "Lead Project Account Manager",
        "years": "May 2019 - Apr 2020",
        "description": "Delivered engaging and polished presentations to highlight products and draw favorable competitor comparisons. Managed high-value accounts through consultative ad campaigns, effective customer solutions and promoting compelling business opportunities. Clients I have manged but not limited to: Xfinity, AT&T Oversaw business development and client analytics that lead to a 12% increase in revenue for the company during my first year. Improved account management by predicting potential competitive threats and outlining proactive solutions. Liaised communication between account holders and cross-functional departments. Assisted in total YoY growth through recommenced marketing Strategies and deep knowledge."
      }
      
    ],
    "skills": [
      {
        "name": "JavaScript"
      },
      {
        "name": "TypeScript"
      },
      {
        "name": "Python"
      },
      {
        "name": "Java"
      },
      {
        "name": "C++"
      },
      {
        "name": "React"
      },
      {
        "name": "Django"
      },
      {
        "name": "Express"
      },
      {
        "name": "Node.js"
      },
      {
        "name": "SQL"
      },
      {
        "name": "Postgres"
      },
      {
        "name": "MongoDB"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Mack - Instant Messaging App",
        "category": "",
        "image": "mack.gif",
        "url": "https://github.com/saifalushi1/mack"
      },
      {
        "title": "Tider - Reddit Clone",
        "category": "",
        "image": "tider.gif",
        "url": "https://github.com/saifalushi1/tider-frontend"
      },
      {
      "title": "Grouper - Personal Calendar App",
        "category": "",
        "image": "grouper.gif",
        "url": "https://github.com/saifalushi1/grouper"
      },
      {
        "title": "Otaku-Emporium - Anime & Manga",
        "category": "",
        "image": "anime.gif",
        "url": "https://otaku-emporium.netlify.app"
      }
    ]
  }
}
